benchmarks/tsung/search-baseline.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">

<!--
  Sprint 12 Slice 6 — Tsung load test: HTTP /search baseline.

  Target: PRD §8.3 — sustain 1000 concurrent searchers, p95 < 500 ms.
  Run: ./benchmarks/tools/tsung-runner.sh search-baseline
       (or: tsung -f benchmarks/tsung/search-baseline.xml start)

  Phases:
    * 30s warmup at 10/s
    * 60s ramp to 100/s
    * 300s sustain at 100/s

  Pick a target host with TSUNG_TARGET=… env var; defaults to
  localhost:4000 (dev). All loadgen happens against the project
  built with `MIX_ENV=prod mix release`.
-->

<tsung loglevel="warning" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="10000"/>
  </clients>

  <servers>
    <server host="localhost" port="4000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="50" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="300" unit="second">
      <users arrivalrate="100" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="user_agent">
      <user_agent probability="100">tsung-guildford-vue/1.0</user_agent>
    </option>
  </options>

  <sessions>
    <session name="search-baseline" probability="100" type="ts_http">
      <!-- One synthetic search request per virtual user. -->
      <request>
        <http url="/search?postcode=SW1A%201AA&amp;radius_metres=25000"
              method="GET"
              version="1.1"/>
      </request>
      <thinktime value="1" random="true"/>
    </session>
  </sessions>
</tsung>